INTRODUCTION TO PANDAS

WHAT IS PANDAS?
a powerful libraries for data manipulation and analysis in python.built on top of numpy.provides data structures like series and dataframe.

#WHY USE PANDAS?
*easy data cleaning and transformation
*efficient handling of large datasets.
*integration with other python libraries like matplotlib and seaborn for visualization.

key data structure in pandas    

*series = 1 dimensional
*dataframes = 2 dimensional

In [18]:
import pandas as pd

In [19]:
#series
s = pd.Series([1,2,3,4,5,6],index = ['a','b','c','d','e','f'])
s

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int64

In [20]:
#dataframe

df = pd.DataFrame({
    "names": ["kashish", "thakur", "jagirdar"],
    "class": ["5yh", "6yh", "yth"]
})

print(df)

      names class
0   kashish   5yh
1    thakur   6yh
2  jagirdar   yth

In [21]:
df.to_csv('friends.csv')

In [22]:
df.to_csv('friends_index_false.csv', index = False)

In [23]:
df.head(2)

     names class
0  kashish   5yh
1   thakur   6yh

In [24]:
df.tail(2)

      names class
1    thakur   6yh
2  jagirdar   yth

In [25]:
import numpy as np
import pandas as pd

# create random data
dataframe = pd.DataFrame({
    "ID": np.arange(1, 11),
    "Name": [f"Person_{i}" for i in range(1, 11)],
    "Score": np.random.randint(50, 100, size=10),
    "Grade": np.random.choice(["A", "B", "C", "D"], size=10)
})

dataframe

   ID       Name  Score Grade
0   1   Person_1     70     A
1   2   Person_2     97     A
2   3   Person_3     66     D
3   4   Person_4     67     A
4   5   Person_5     69     B
5   6   Person_6     63     B
6   7   Person_7     73     A
7   8   Person_8     61     A
8   9   Person_9     90     C
9  10  Person_10     87     D

In [26]:
df.to_excel("random_data.xlsx", index=False)

In [27]:
data = pd.read_excel("random_data.xlsx")
data.head()

      names class
0   kashish   5yh
1    thakur   6yh
2  jagirdar   yth

In [28]:
dataframe.describe()

             ID      Score
count  10.00000  10.000000
mean    5.50000  74.300000
std     3.02765  12.463725
min     1.00000  61.000000
25%     3.25000  66.250000
50%     5.50000  69.500000
75%     7.75000  83.500000
max    10.00000  97.000000

In [29]:
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      10 non-null     int64
 1   Name    10 non-null     object
 2   Score   10 non-null     int32
 3   Grade   10 non-null     object
dtypes: int32(1), int64(1), object(2)
memory usage: 412.0+ bytes

In [30]:
#data selection

type(dataframe["ID"])

pandas.core.series.Series

In [34]:
print(dataframe.columns)

Index(['ID', 'Name', 'Score', 'Grade'], dtype='object')

In [35]:
dataframe[["ID", "Score"]]

   ID  Score
0   1     70
1   2     97
2   3     66
3   4     67
4   5     69
5   6     63
6   7     73
7   8     61
8   9     90
9  10     87

In [36]:
df.iloc[0]

names    kashish
class        5yh
Name: 0, dtype: object

In [ ]:
data = pd.read_excel("random_data.xlsx")
data.head()

df.dropna #used for remove rows how have missing data
df.fillna(0)

In [42]:
df['class'] = df['class'].astype(str)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   names   3 non-null      object
 1   class   3 non-null      object
dtypes: object(2)
memory usage: 180.0+ bytes

In [40]:
print(df.columns.tolist())

['names', 'class']

In [43]:
len(df)

3

In [45]:
df["Zeros"] = [0 for i in range(len(df))]
df

      names class  Zeros
0   kashish   5yh      0
1    thakur   6yh      0
2  jagirdar   yth      0

In [46]:
def fx(a):
    return a+1

df["Zeros + 1"] = df["Zeros"].apply(fx)

df

      names class  Zeros  Zeros + 1
0   kashish   5yh      0          1
1    thakur   6yh      0          1
2  jagirdar   yth      0          1

In [47]:
pd.concat([df,dataframe])

      names class  Zeros  Zeros + 1    ID       Name  Score Grade
0   kashish   5yh    0.0        1.0   NaN        NaN    NaN   NaN
1    thakur   6yh    0.0        1.0   NaN        NaN    NaN   NaN
2  jagirdar   yth    0.0        1.0   NaN        NaN    NaN   NaN
0       NaN   NaN    NaN        NaN   1.0   Person_1   70.0     A
1       NaN   NaN    NaN        NaN   2.0   Person_2   97.0     A
2       NaN   NaN    NaN        NaN   3.0   Person_3   66.0     D
3       NaN   NaN    NaN        NaN   4.0   Person_4   67.0     A
4       NaN   NaN    NaN        NaN   5.0   Person_5   69.0     B
5       NaN   NaN    NaN        NaN   6.0   Person_6   63.0     B
6       NaN   NaN    NaN        NaN   7.0   Person_7   73.0     A
7       NaN   NaN    NaN        NaN   8.0   Person_8   61.0     A
8       NaN   NaN    NaN        NaN   9.0   Person_9   90.0     C
9       NaN   NaN    NaN        NaN  10.0  Person_10   87.0     D